In [6]:
import pandas as pd
import numpy as np

# Removing. Transmuting as Add data to a dataframe.

df = pd.read_csv('astronauts.csv')
# df.info()
birth_date = pd.to_datetime(df['Birth Date'], format="%m/%d/%Y")
birth_date.dt.year
zarya = pd.to_datetime('1998-11-20')
df['age_at_zarya'] = (zarya - birth_date).astype('timedelta64[Y]')
df.head(3)
df['birth'] = birth_date
df
# Categoricals
df["Military Rank"].unique()
df['Military Rank'].dtype

dtype('O')

In [7]:
df["Military Rank"] = df["Military Rank"].astype('category')
# Change the format to int .
df.age_at_zarya.astype("str").astype("str").astype("float").astype("int")[0]

31

In [8]:
df['Military Rank']
# Removing Colunms or Rows.

0            NaN
1            NaN
2        Colonel
3        Colonel
4        Colonel
         ...
352          NaN
353    Commander
354      Colonel
355      Captain
356      Colonel
Name: Military Rank, Length: 357, dtype: category
Categories (12, object): ['Brigadier General', 'Captain', 'Chief Warrant Officer', 'Colonel', ..., 'Major', 'Major General', 'Rear Admiral', 'Vice Admiral']

In [9]:
df2 = df[["Name", "Year", "Group"]]

In [15]:
df2.head()
# Droping Column Named Group.
df2.drop("Group", axis=1)
# Droping Row using Index.
df2.drop(1).head()

               Name    Year  Group
0   Joseph M. Acaba  2004.0   19.0
2  James C. Adamson  1984.0   10.0
3   Thomas D. Akers  1987.0   12.0
4       Buzz Aldrin  1963.0    3.0
5   Andrew M. Allen  1987.0   12.0

In [17]:
# Droping more than one Column.
df2.drop(columns=["Year", "Group"]).head()

               Name
0   Joseph M. Acaba
1    Loren W. Acton
2  James C. Adamson
3   Thomas D. Akers
4       Buzz Aldrin

In [18]:
# Adding  Rows
df2.append({"Name": "Samuel Hinton", "Year": 2020,
           "Group": 20.0}, ignore_index=True)

                      Name    Year  Group
0          Joseph M. Acaba  2004.0   19.0
1           Loren W. Acton     NaN    NaN
2         James C. Adamson  1984.0   10.0
3          Thomas D. Akers  1987.0   12.0
4              Buzz Aldrin  1963.0    3.0
..                     ...     ...    ...
353  Neil W. Woodward III   1998.0   17.0
354       Alfred M. Worden  1966.0    5.0
355          John W. Young  1962.0    2.0
356        George D. Zamka  1998.0   17.0
357          Samuel Hinton  2020.0   20.0

[358 rows x 3 columns]

In [20]:
# Creating a new dataFrame .
df_sis = pd.DataFrame({"Name": ["Al Hilton"], "Year": [2010], "Group": [20.0]})
df_sis

        Name  Year  Group
0  Al Hilton  2010   20.0

In [24]:
df2.append(df_sis, ignore_index=True)

                      Name    Year  Group
0          Joseph M. Acaba  2004.0   19.0
1           Loren W. Acton     NaN    NaN
2         James C. Adamson  1984.0   10.0
3          Thomas D. Akers  1987.0   12.0
4              Buzz Aldrin  1963.0    3.0
..                     ...     ...    ...
353  Neil W. Woodward III   1998.0   17.0
354       Alfred M. Worden  1966.0    5.0
355          John W. Young  1962.0    2.0
356        George D. Zamka  1998.0   17.0
357              Al Hilton  2010.0   20.0

[358 rows x 3 columns]

In [25]:
# Add Colunms